Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/drugs_and_medicines/prescription_charges_for_medical_card_holders.html.txt.tmx
Source language: en
Languages: ga

source: Prescription charges for medical card holders
ga: Táillí oidis do shealbhóirí cárta leighis

source: If you have a medical card, there is a charge for prescribed medicines and other items that you get on prescription from pharmacies
ga: Ón 1 Deireadh Fómhair 2010, íocann daoine ag a bhfuil cártaí leighis táillí do chógais agus d’earraí eile a fhaigheann siad ar oideas ó chógaslanna

source: The prescription charge is €2.50 for each item that is dispensed to you under the medical card scheme, up to a maximum of €25 per month per person or family. From 1 March 2017, the prescription charge for medical card holders over the age of 70 will be €2 per item and the monthly maximum will be €20
ga: Is ionann an táille oidis agus €2.50 do gach earra a dháiltear ort faoin scéim cártaí leighis (€2 do dhaoine os cionn 70 bliain d’aois), a mhéid le €25 sa mhí in aghaidh duine nó an teaghlaigh (€20 do dhaoine os cionn 70 bliain d’aois)

source: Once your pharmacy can identify all of your family members then you should not pay more than €25 per month
ga: A fhad agus is féidir le do chógaslann gach duine de mhuintir do theaghlaigh a shainaithint, níor cheart duit níos mó ná €25 sa mhí a íoc

source: A family is defined as you, your spouse or partner, any children under 16 years of age and any children between 16 and 21 years of age who are in full time education
ga: Is éard is teaghlach ann, tú féin, do chéile nó do pháirtnéir, aon leanaí faoi 16 bliana d’aois agus aon leanaí idir 16 agus 21 bliain d’aois atá in oideachas lánaimseartha

source: You can set your family up as a family group on medicalcard.ie and print off a family certificate to give to your pharmacist
ga: Féadfaidh tú do theaghlach a shocrú mar ghrúpa teaghlaigh ar medicalcard.ie agus deimhniú teaghlaigh a phriontáil lena thabhairt do do chógaiseoir

source: This will show all of the members of your family so that the pharmacy will not collect charges above the monthly limit
ga: Léireoidh seo gach duine de mhuintir do theaghlaigh ionas nach mbaileoidh an chógaslann táillí os cionn na huasteorann míosúla

source: If you do not have access to the internet you can get assistance from your Local Health Office or call 1890 252 919 and they will take the details and send you the certificate. Your local pharmacist may also be able to help you
ga: Mura bhfuil rochtain agat ar an idirlíon, féadfaidh tú cúnamh a fháil ó d'Oifig Sláinte Áitiúil nó glao a chur ar 1890 252 919 agus glacfar na sonraí uait agus seolfar chugat an deimhniú

source: You will need to have the medical card number for each member of your family
ga: Ina theannta sin, d’fhéadfadh do chógaiseoir áitiúil cabhrú leat

source: The prescription charges are eligible for tax relief for medical expenses
ga: Beidh ort uimhir an chárta leighis a bheith agat do gach duine i do theaghlach

source: Refunds if you pay more than the monthly limit
ga: Aisíocaíochtaí má íocann tú níos mó ná €25 sa mhí

source: The Health Service Executive (HSE) issues refunds automatically every 6 months, based on the information received from your pharmacy
ga: Eiseoidh FSS aisíocaíochtaí go huathoibríoch ar bhonn ráithiúil, bunaithe ar an bhfaisnéis a fhaightear ó do chógaslann

source: Refunds are issued for amounts over €10. Refunds under €10 are carried over to the next refund payment date
ga: Féadfaidh tú aisíocaíochtaí a sheachaint go hiomlán, áfach, má thugann tú féin agus do theaghlach cuairt ar an gcógaslann chéanna agus más féidir leis an gcógaiseoir gach duine de do theaghlach a shainaithint

source: You can avoid the need for a refund if you and your family visit the same pharmacy and your pharmacist can identify all of your family members
ga: Má shíleann tú nach bhfuair tú an aisíocaíocht a bhí dlite duit, féadfaidh tú foirm éilimh PC1 (pdf) a íoslódáil nó í a bhailiú ag d’Oifig Sláinte Áitiúil ní trí ghlao a chur ar FSS ag 1890 252 919 (ó Luan go hAoine, idir 9am agus 5pm)

source: If you have a question about refunds you can contact 1890 252 919
ga: Má theastaíonn cúnamh uait chun éileamh a dhéanamh, féadfaidh tú teagmháil a dhéanamh le FSS ag 1890 252 919

source: Medical card holders who do not pay the prescription charge
ga: Sealbhóirí cárta leighis nach n-íocann an táille oidis

source: Certain people and certain products are not liable for the prescription charge:
ga: Níl daoine agus earraí áirithe faoi dhliteanas íoc as an táille oidis

source: • People who qualify for the Long Term Illness Scheme are entitled to get the drugs and medicines for the treatment of that illness free of charge
ga: Íocann cúramóirí atá freagrach as leanaí faoi chúram táillí oidis leis an gcógaslann agus éilíonn siad aisíocaíocht iomlán ó FSS

source: • People who have a Health Amendment Act Card are entitled to get approved prescribed drugs and medicines free of charge
ga: • Ní ann d’aon táille ar Mheatadón a sholáthraítear faoin bPrótacal um Chóireáil Meatadóin

source: • Children in the care of the HSE who have their own medical card
ga: • Earraí a sholáthraítear faoin Scéim Tinnis Fhadtéarmaigh

source: • Asylum seekers living in direct provision accommodation
ga: • Daoine atá faoi chuimsiú ag an Acht Sláinte (Leasú), 1996

source: • There is no charge for methadone supplied to patients participating in the Methadone Treatment Scheme
ga: • Más iarrthóir tearmainn thú i do chonaí i bhforáil dhíreach

source: • High Tech products and medicines, usually only prescribed in hospitals, for example anti-rejection drugs for transplant patients or medicines used in conjunction with chemotherapy
ga: • An Scéim Ardteicneolaíochta: Táirgí agus cógais Ardteicneolaíochta, ar nós drugaí frithdhiúltaithe d'othair thrasphlandaithe nó cógais a úsáidtear i gcomhar le ceimiteiripe

source: As the supply of High Tech Medicines operates on the basis of a patient care fee, a prescription charge does not apply
ga: Mar gheall go n-oibríonn soláthar Cógais Ardteicneolaíochta ar bhonn táille chúram othair, ní ghearrtar táille oidis
